SET NAMES UTF8;
DROP DATABASE IF EXISTS ty;
CREATE DATABASE ty CHARSET=UTF8;
USE ty;
/*用户表*/
CREATE TABLE ty_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  role VARCHAR(32),
  email VARCHAR(128),
  tel VARCHAR(64)
);
INSERT INTO ty_user VALUES
(1, '卢誉秋', '123456','管理员','770364263@qq.com','18778543910');

/*财产转移表*/
CREATE TABLE ty_product(
  pid INT PRIMARY KEY AUTO_INCREMENT,
  tdate VARCHAR(64),
  name VARCHAR(64),
  address VARCHAR(128),
  tag VARCHAR(128),
  detailed VARCHAR(128)
);
INSERT INTO ty_product VALUES
(1,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(2,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(3,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(4,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(5,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(6,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(7,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(8,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(9,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(10,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(11,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(12,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(13,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(14,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(15,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(16,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(17,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(18,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(19,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(20,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(21,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(22,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(23,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(24,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(25,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(26,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(27,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(28,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(29,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(30,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(31,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(32,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(33,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(34,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(35,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(36,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(37,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(38,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(39,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(40,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(41,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(42,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(43,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(44,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(45,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用'),
(46,'2017-03-02','誉秋','碎片科技','过桥费','这是一笔过桥费用'),
(47,'2017-03-18','天宇','空点科技','保护费','这是一笔保护费，交了钱就可以在这里摆摊'),
(48,'2017-04-12','肥仔','罐头天下','再教育费','此人不懂为官之道，这必笔是对他再教育的费用');

/*领用申请表*/
CREATE TABLE ty_property(
  lid INT PRIMARY KEY AUTO_INCREMENT,
  number VARCHAR(64),
  name VARCHAR(64),
  usee VARCHAR(64),
  ldate VARCHAR(64),
  department VARCHAR(128),
  username VARCHAR(128),
  resource VARCHAR(128),
  tag VARCHAR(64),
  detailed VARCHAR(512)
);
INSERT INTO ty_property VALUES
(1,'10086','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(2,'10087','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(3,'10088','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(4,'10089','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(5,'10090','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(6,'10091','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(7,'10092','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(8,'10093','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(9,'10094','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(10,'10095','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(11,'10096','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(12,'10097','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(13,'10098','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(14,'10099','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(15,'100100','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(16,'100101','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(17,'100102','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(18,'100103','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(19,'100104','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(20,'100105','mac mini主机','研发','2017-04-10','技术部','卢誉秋','公用', '通过','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14');
/*领用详情表*/
CREATE TABLE ty_borrowed(
  bid INT PRIMARY KEY AUTO_INCREMENT,
  tdata VARCHAR(128),
  number VARCHAR(64),
  name VARCHAR(64),
  tag VARCHAR(64),
  detailed VARCHAR(512)
);
INSERT INTO ty_borrowed VALUES
(1,'2017-04-10','001','卢誉秋','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(2,'2017-04-15','002','卢雅欣','未归还','一台张桌子，2017-04-15领用，至今未归还'),
(3,'2017-04-10','003','卢天宇','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(4,'2017-04-15','004','然然','未归还','一台张桌子，2017-04-15领用，至今未归还'),
(5,'2017-04-10','005','霍利','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(6,'2017-04-15','006','张峰','未归还','一台张桌子，2017-04-15领用，至今未归还'),
(7,'2017-04-10','007','赵达','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(8,'2017-04-15','008','艾米','未归还','一台张桌子，2017-04-15领用，至今未归还'),
(9,'2017-04-10','009','露娜','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(10,'2017-04-15','0010','彭强','未归还','一台张桌子，2017-04-15领用，至今未归还'),
(11,'2017-04-10','0011','无敌','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(12,'2017-04-15','0013','龙鹏','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(13,'2017-04-15','0014','候局','未归还','一台张桌子，2017-04-15领用，至今未归还'),
(14,'2017-04-10','0015','祁同伟','归还','一台笔记本电脑，2017-04-10领用，归还日期为2017-04-14'),
(15,'2017-04-15','0016','高玉良','未归还','一台张桌子，2017-04-15领用，至今未归还');



/*款项增加表*/
CREATE TABLE ty_payment(
  aid INT PRIMARY KEY AUTO_INCREMENT,
  number VARCHAR(64),
  region VARCHAR(64),
  kdate1 VARCHAR(64),
  kdate2 VARCHAR(64),
  resource VARCHAR(128),
  adesc VARCHAR(128)
);



